app/Controllers/Album.php

    public function edit($id){
      //recibimos como argumento del anchor <a></a> el id del genre a modificar
      //Accedemos al modelo
      $albumModel = new \App\Models\AlbumsModel();
      $genreModel = new \App\Models\GenreModel();
      //Recuperamos todos los registros por medio de la funcion find()
       $datag = $genreModel->listarNombres();
       $mensaje = session('mensaje');
      //Recuperamos el registro por medio de la funcion find(), filtrando por $id
      $data1['albums'] = $albumModel->find($id);//Asignamos lo recuperado
---
SELECT *
FROM `albums`
WHERE `albums`.`id` = '2'