app/Controllers/Genre.php

    public function edit($id){
      //recibimos como argumento del anchor <a></a> el id del genre a modificar
      //Accedemos al modelo
      $genreModel = new \App\Models\GenreModel();
      //Recuperamos el registro por medio de la funcion find(), filtrando por $id
      $data['genre'] = $genreModel->find($id);//Asignamos lo recuperado
---
SELECT *
FROM `genres`
WHERE `genres`.`id` = '1'